Table of Contents:

- Descriptive statistics
- Summarizing data: describe
- Index of min/max values
- Value counts (histogramming) / mode)
- Discretization and quantiling

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame(
    {
        'name': ['Emma', 'Harry', 'khashy', 'Chester', 'fariborz', 'kourush'],
        'age': [20, 20, np.NaN, 25, 50, np.NaN],
        'income': [3500000, 2000000, 100000, np.NaN, 1000, np.NaN],
        'id' : np.random.randn(6),
    }
)
df

       name   age     income        id
0      Emma  20.0  3500000.0 -0.984651
1     Harry  20.0  2000000.0  0.697746
2    khashy   NaN   100000.0  0.489154
3   Chester  25.0        NaN  0.308554
4  fariborz  50.0     1000.0 -1.376147
5   kourush   NaN        NaN  1.058736

In [3]:
df['age'].mean()

28.75

In [4]:
df.loc[0, 'age':].mean()

1166673.0051162418

In [5]:
df2 = pd.DataFrame(
    {
        "one": pd.Series(np.random.randn(3), index=["a", "b", "c"]),
        "two": pd.Series(np.random.randn(4), index=["a", "b", "c", "d"]),
        "three": pd.Series(np.random.randn(3), index=["b", "c", "d"]),
    }
)
df2

        one       two     three
a -0.311662 -0.710599       NaN
b  0.867480 -0.922103 -0.918198
c  0.170806 -1.675954  0.117454
d       NaN -1.589849 -0.125601

In [6]:
df2.mean(axis=1)

a   -0.511131
b   -0.324274
c   -0.462565
d   -0.857725
dtype: float64

In [7]:
df2.mean(axis='rows')

one      0.242208
two     -1.224626
three   -0.308782
dtype: float64

In [8]:
df2.mean(axis='index')

one      0.242208
two     -1.224626
three   -0.308782
dtype: float64


<br></br>
All such methods have a **skipna** option signaling whether to exclude missing data (True by default):

In [9]:
# with False skipna, columns with Null values return None
df2.mean(skipna=False)

one           NaN
two     -1.224626
three         NaN
dtype: float64

### cumsum

Return cumulative sum over a DataFrame or Series axis.

In [10]:
df2

        one       two     three
a -0.311662 -0.710599       NaN
b  0.867480 -0.922103 -0.918198
c  0.170806 -1.675954  0.117454
d       NaN -1.589849 -0.125601

In [11]:
df2.cumsum(axis=1)

        one       two     three
a -0.311662 -1.022261       NaN
b  0.867480 -0.054624 -0.972822
c  0.170806 -1.505148 -1.387694
d       NaN -1.589849 -1.715450

Note that methods like cumsum() and cumprod() preserve the location of NaN values.

### cumprod

Return cumulative product over a DataFrame or Series axis.

In [12]:
df2.cumprod(axis=1)

        one       two     three
a -0.311662  0.221467       NaN
b  0.867480 -0.799906  0.734472
c  0.170806 -0.286263 -0.033623
d       NaN -1.589849  0.199687

### nunique()

Series.nunique() will return the number of unique non-NA values in a Series:

In [13]:
df2

        one       two     three
a -0.311662 -0.710599       NaN
b  0.867480 -0.922103 -0.918198
c  0.170806 -1.675954  0.117454
d       NaN -1.589849 -0.125601

In [14]:
df2.nunique()

one      3
two      4
three    3
dtype: int64

### Summarizing data: describe

In [15]:
df2

        one       two     three
a -0.311662 -0.710599       NaN
b  0.867480 -0.922103 -0.918198
c  0.170806 -1.675954  0.117454
d       NaN -1.589849 -0.125601

In [16]:
df2.describe()

            one       two     three
count  3.000000  4.000000  3.000000
mean   0.242208 -1.224626 -0.308782
std    0.592805  0.480565  0.541581
min   -0.311662 -1.675954 -0.918198
25%   -0.070428 -1.611375 -0.521900
50%    0.170806 -1.255976 -0.125601
75%    0.519143 -0.869227 -0.004073
max    0.867480 -0.710599  0.117454

You can select specific percentiles to include in the output:

In [17]:
df2.describe(percentiles=[0, 0.05, 0.25, 0.5, 0.75, 0.95, 1])

            one       two     three
count  3.000000  4.000000  3.000000
mean   0.242208 -1.224626 -0.308782
std    0.592805  0.480565  0.541581
min   -0.311662 -1.675954 -0.918198
0%    -0.311662 -1.675954 -0.918198
5%    -0.263415 -1.663038 -0.838938
25%   -0.070428 -1.611375 -0.521900
50%    0.170806 -1.255976 -0.125601
75%    0.519143 -0.869227 -0.004073
95%    0.797812 -0.742325  0.093149
100%   0.867480 -0.710599  0.117454
max    0.867480 -0.710599  0.117454

For a non-numerical Series object, describe() will give a simple summary of the number of unique values and most frequently occurring values:

In [18]:
df

       name   age     income        id
0      Emma  20.0  3500000.0 -0.984651
1     Harry  20.0  2000000.0  0.697746
2    khashy   NaN   100000.0  0.489154
3   Chester  25.0        NaN  0.308554
4  fariborz  50.0     1000.0 -1.376147
5   kourush   NaN        NaN  1.058736

In [19]:
df['name'].describe()

count        6
unique       6
top       Emma
freq         1
Name: name, dtype: object

Note that on a mixed-type DataFrame object, describe() will restrict the summary to include **only numerical** columns or, if none are, only categorical columns:

This behavior can be controlled by providing a list of types as include/exclude arguments. The special value all can also be used:

In [20]:
df.describe(include=['object'])

        name
count      6
unique     6
top     Emma
freq       1

In [21]:
df.describe(include=['number'])

             age        income        id
count   4.000000  4.000000e+00  6.000000
mean   28.750000  1.400250e+06  0.032232
std    14.361407  1.675032e+06  0.979728
min    20.000000  1.000000e+03 -1.376147
25%    20.000000  7.525000e+04 -0.661350
50%    22.500000  1.050000e+06  0.398854
75%    31.250000  2.375000e+06  0.645598
max    50.000000  3.500000e+06  1.058736

In [22]:
df.describe(include='all') #it's kinda useless

        name        age        income        id
count      6   4.000000  4.000000e+00  6.000000
unique     6        NaN           NaN       NaN
top     Emma        NaN           NaN       NaN
freq       1        NaN           NaN       NaN
mean     NaN  28.750000  1.400250e+06  0.032232
std      NaN  14.361407  1.675032e+06  0.979728
min      NaN  20.000000  1.000000e+03 -1.376147
25%      NaN  20.000000  7.525000e+04 -0.661350
50%      NaN  22.500000  1.050000e+06  0.398854
75%      NaN  31.250000  2.375000e+06  0.645598
max      NaN  50.000000  3.500000e+06  1.058736

### Index of min/max values

The **idxmin()** and **idxmax()** functions on Series and DataFrame compute the index labels with the minimum and maximum corresponding values:

In [23]:
youngest_index = df['age'].idxmin()

In [24]:
df.loc[youngest_index, 'age'] # minmum age in df

20.0

In [25]:
highest_income_index = df['income'].idxmax()

In [26]:
df.loc[highest_income_index, 'income']

3500000.0

When there are multiple rows (or columns) matching the minimum or maximum value, idxmin() and idxmax() return the **first** matching index:

**Note**: idxmin and idxmax are called argmin and argmax in NumPy.

### Value counts (histogramming) / mode

In [27]:
df['age'].value_counts()

age
20.0    2
25.0    1
50.0    1
Name: count, dtype: int64

In [28]:
df.loc[:,'name':'age'].value_counts()

name      age
Chester   25.0    1
Emma      20.0    1
Harry     20.0    1
fariborz  50.0    1
Name: count, dtype: int64

### Discretization and quantiling


Continuous values can be discretized using the **cut() (bins based on values)** and **qcut() (bins based on sample quantiles)** functions:

#### cut

In [29]:
pd.cut(
    [1, 2, 3, 4],
    3
)

[(0.997, 2.0], (0.997, 2.0], (2.0, 3.0], (3.0, 4.0]]
Categories (3, interval[float64, right]): [(0.997, 2.0] < (2.0, 3.0] < (3.0, 4.0]]

In [30]:
pd.cut(
    np.arange(100),
    5,
    labels=['a', 'b', 'c', 'd', 'e']
)

['a', 'a', 'a', 'a', 'a', ..., 'e', 'e', 'e', 'e', 'e']
Length: 100
Categories (5, object): ['a' < 'b' < 'c' < 'd' < 'e']

You can also customize the cut edges by proving an array of edges. Here we cut the array at -5, -1, 0, 1, 5 values:

In [31]:
pd.cut(
    np.arange(20),
    [0, 25, 50, 75, 100],
    labels=['a', 'b', 'c', 'd'])

[NaN, 'a', 'a', 'a', 'a', ..., 'a', 'a', 'a', 'a', 'a']
Length: 20
Categories (4, object): ['a' < 'b' < 'c' < 'd']

In [32]:
pd.cut(
    np.arange(20),
    np.arange(0, 20, 5)
)

[NaN, (0.0, 5.0], (0.0, 5.0], (0.0, 5.0], (0.0, 5.0], ..., (10.0, 15.0], NaN, NaN, NaN, NaN]
Length: 20
Categories (3, interval[int64, right]): [(0, 5] < (5, 10] < (10, 15]]

#### qcut

In [33]:
arr = np.random.normal(size=1000)
factor = pd.qcut(
    arr,
    [0, 0.25, 0.5, 0.75, 1]
)
factor

[(-3.211, -0.654], (-3.211, -0.654], (-0.654, -0.0112], (-3.211, -0.654], (0.672, 2.892], ..., (0.672, 2.892], (-0.654, -0.0112], (0.672, 2.892], (-0.0112, 0.672], (-0.654, -0.0112]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.211, -0.654] < (-0.654, -0.0112] < (-0.0112, 0.672] < (0.672, 2.892]]

In [34]:
pd.value_counts(factor)

/var/folders/ft/r3rwscxj6bxgq3r7vv3pf6340000gn/T/ipykernel_34090/524676245.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(factor)

(-3.211, -0.654]     250
(-0.654, -0.0112]    250
(-0.0112, 0.672]     250
(0.672, 2.892]       250
Name: count, dtype: int64

<br><br>

We can also pass infinite values to define the bins:

In [35]:
pd.cut(
    arr,
    [-np.inf, 0, np.inf]
)

[(-inf, 0.0], (-inf, 0.0], (-inf, 0.0], (-inf, 0.0], (0.0, inf], ..., (0.0, inf], (-inf, 0.0], (0.0, inf], (0.0, inf], (-inf, 0.0]]
Length: 1000
Categories (2, interval[float64, right]): [(-inf, 0.0] < (0.0, inf]]

You can also have **repetitive labels**, but you have to set the **order** keyword argument to False as it doesn't make sense to define order with repitative values. Otherwise, you will get ValueError.

In [36]:
arr = np.random.normal(size=10)
arr

array([ 0.25221919,  1.39216627,  0.17140153, -0.92448342, -1.56098357,
        1.53441896,  1.02820723, -1.5300965 , -0.19595366, -1.34767461])

In [37]:
pd.cut(
    arr,
    [-4, -2.5, -1, 0, 1, 2.5, 4],
    labels=['impossible','rare', 'normal', 'normal', 'rare', 'impossible'],
    ordered=False,
)

['normal', 'rare', 'normal', 'normal', 'rare', 'rare', 'rare', 'rare', 'normal', 'rare']
Categories (3, object): ['impossible', 'normal', 'rare']